{
  "nodes": [
    {
      "op": "null", 
      "name": "data_0", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_0", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_0"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_cast", 
        "layout": "NCHW", 
        "hash": "7ce64eb9a8315e66"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_lrn", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_lrn", 
        "hash": "65a34770622bea20"
      }, 
      "inputs": [
        [
          2, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_3"
      }, 
      "inputs": [
        [
          3, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_cast", 
        "hash": "c7c78aafafec17d8"
      }, 
      "inputs": [
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_lrn_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_lrn_1", 
        "hash": "598c555121225b98"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d", 
        "layout": "NCHW", 
        "hash": "b586d7dea6dd0a85"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_cast_1", 
        "hash": "fb2479e34c14a1bb"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p92", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p93", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_relu", 
        "out_layout": "", 
        "kernel_layout": "OIHW", 
        "data_layout": "NCHW", 
        "hash": "4ddb772fbe2ae11d"
      }, 
      "inputs": [
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p94", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p95", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_1", 
        "out_layout": "", 
        "kernel_layout": "OIHW", 
        "data_layout": "NCHW", 
        "hash": "2843227e8becd9e6"
      }, 
      "inputs": [
        [
          8, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_8"
      }, 
      "inputs": [
        [
          14, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p96", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p97", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_2", 
        "out_layout": "", 
        "kernel_layout": "OIHW", 
        "data_layout": "NCHW", 
        "hash": "eee85bbbc4bc79c2"
      }, 
      "inputs": [
        [
          8, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p98", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p99", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_3", 
        "out_layout": "", 
        "kernel_layout": "OIHW", 
        "data_layout": "NCHW", 
        "hash": "b5aeaed520e58a6f"
      }, 
      "inputs": [
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_1", 
        "layout": "NCHW", 
        "hash": "d05b7ac7b96ce040"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_11"
      }, 
      "inputs": [
        [
          22, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_concatenate", 
        "hash": "5c8b7962fb3ae553"
      }, 
      "inputs": [
        [
          11, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_14", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_14"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_17", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_17"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_22", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_22"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p100", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p101", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_4", 
        "out_layout": "", 
        "kernel_layout": "OIHW", 
        "data_layout": "NCHW", 
        "hash": "89551158ce169fb6"
      }, 
      "inputs": [
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_25", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_25"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_concatenate_1", 
        "hash": "5f02c57800b1b221"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_2", 
        "layout": "NCHW", 
        "hash": "052a9cc0bde8fc53"
      }, 
      "inputs": [
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_28", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_28"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_31", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_31"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_36", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_36"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p102", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p103", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_5", 
        "out_layout": "", 
        "kernel_layout": "OIHW", 
        "data_layout": "NCHW", 
        "hash": "20706182c2f86e68"
      }, 
      "inputs": [
        [
          36, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_39", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_39"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_concatenate_2", 
        "hash": "dfbcbd75b474764c"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ], 
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_42", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_42"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_45", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_45"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_50", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_50"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p104", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p105", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_6", 
        "out_layout": "", 
        "kernel_layout": "OIHW", 
        "data_layout": "NCHW", 
        "hash": "0ee0a9d5435c8300"
      }, 
      "inputs": [
        [
          44, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_53", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_53"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_concatenate_3", 
        "hash": "b710ff625029d95e"
      }, 
      "inputs": [
        [
          42, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_56", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_56"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_59", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_59"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_64", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_64"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p106", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p107", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_61", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_6", 
        "out_layout": "", 
        "kernel_layout": "OIHW", 
        "data_layout": "NCHW", 
        "hash": "0ee0a9d5435c8300"
      }, 
      "inputs": [
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_67", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_67"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_concatenate_4", 
        "hash": "a99a43d46da258a6"
      }, 
      "inputs": [
        [
          50, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ], 
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_70", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_70"
      }, 
      "inputs": [
        [
          57, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_73", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_73"
      }, 
      "inputs": [
        [
          57, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_78", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_78"
      }, 
      "inputs": [
        [
          57, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p108", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p109", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_7", 
        "out_layout": "", 
        "kernel_layout": "OIHW", 
        "data_layout": "NCHW", 
        "hash": "a835a12a42009897"
      }, 
      "inputs": [
        [
          60, 
          0, 
          0
        ], 
        [
          61, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_81", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_81"
      }, 
      "inputs": [
        [
          57, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_concatenate_5", 
        "hash": "3c91d96a7dd5c481"
      }, 
      "inputs": [
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ], 
        [
          64, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_84", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_84"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_87", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_87"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_92", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_92"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p110", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p111", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_8", 
        "out_layout": "", 
        "kernel_layout": "OIHW", 
        "data_layout": "NCHW", 
        "hash": "89da3f7acc742c08"
      }, 
      "inputs": [
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ], 
        [
          70, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_95", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_95"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_concatenate_6", 
        "hash": "75ec82d2f45ddd8d"
      }, 
      "inputs": [
        [
          66, 
          0, 
          0
        ], 
        [
          67, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_3", 
        "layout": "NCHW", 
        "hash": "26292dc356368285"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_98", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_98"
      }, 
      "inputs": [
        [
          74, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_101", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_101"
      }, 
      "inputs": [
        [
          74, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_106", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_106"
      }, 
      "inputs": [
        [
          74, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p112", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p113", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_9", 
        "out_layout": "", 
        "kernel_layout": "OIHW", 
        "data_layout": "NCHW", 
        "hash": "da2884337e138d57"
      }, 
      "inputs": [
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ], 
        [
          79, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_109", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_109"
      }, 
      "inputs": [
        [
          74, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_concatenate_7", 
        "hash": "3c5f6c86e8706939"
      }, 
      "inputs": [
        [
          75, 
          0, 
          0
        ], 
        [
          76, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_112", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_112"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_115", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_115"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_120", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_120"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p114", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p115", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_10", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_nn_relu_10", 
        "out_layout": "", 
        "kernel_layout": "OIHW", 
        "data_layout": "NCHW", 
        "hash": "7297eddecac79ad5"
      }, 
      "inputs": [
        [
          85, 
          0, 
          0
        ], 
        [
          86, 
          0, 
          0
        ], 
        [
          87, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_123", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_123"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_concatenate_8", 
        "hash": "0ee7c301c85050ab"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          0
        ], 
        [
          89, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tvmgen_default_mera_drp_126", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_tvmgen_default_mera_drp_126"
      }, 
      "inputs": [
        [
          90, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_max", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_max", 
        "hash": "cbfcd6dff5380ecb"
      }, 
      "inputs": [
        [
          91, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_subtract_exp", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_subtract_exp", 
        "hash": "0c615c7a0f750f8f"
      }, 
      "inputs": [
        [
          91, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_sum", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_sum", 
        "hash": "874035bcfa884cd1"
      }, 
      "inputs": [
        [
          93, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_divide", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_divide", 
        "hash": "66692324a3e33d10"
      }, 
      "inputs": [
        [
          93, 
          0, 
          0
        ], 
        [
          94, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    9, 
    10, 
    12, 
    13, 
    16, 
    17, 
    19, 
    20, 
    28, 
    29, 
    37, 
    38, 
    45, 
    46, 
    53, 
    54, 
    61, 
    62, 
    69, 
    70, 
    78, 
    79, 
    86, 
    87
  ], 
  "heads": [
    [
      95, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float16", 
        "float32", 
        "float32", 
        "float16", 
        "float32", 
        "float32", 
        "float32", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float32", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16", 
        "float16"
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        1, 
        2, 
        1, 
        2, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        7, 
        8, 
        9, 
        10, 
        11, 
        8, 
        12, 
        13, 
        14, 
        2, 
        8, 
        1, 
        9, 
        2, 
        14, 
        15, 
        16, 
        8, 
        5, 
        1, 
        9, 
        5, 
        8, 
        14, 
        17, 
        18, 
        19, 
        14, 
        9, 
        5, 
        8, 
        19, 
        20, 
        21, 
        14, 
        19, 
        9, 
        14, 
        5, 
        19, 
        22, 
        23, 
        8, 
        19, 
        9, 
        14, 
        8, 
        19, 
        24, 
        25, 
        5, 
        19, 
        2, 
        5, 
        8, 
        19, 
        26, 
        27, 
        14, 
        9, 
        1, 
        5, 
        19, 
        14, 
        28, 
        29, 
        30, 
        8, 
        9, 
        5, 
        14, 
        8, 
        19, 
        31, 
        32, 
        9, 
        19, 
        5, 
        28, 
        33, 
        19, 
        33, 
        28
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 3, 224, 224], 
        [1, 64, 112, 112], 
        [1, 64, 56, 56], 
        [1, 64, 56, 56], 
        [1, 192, 56, 56], 
        [1, 192, 56, 56], 
        [1, 192, 56, 56], 
        [1, 192, 28, 28], 
        [1, 192, 28, 28], 
        [64, 192, 1, 1], 
        [1, 64, 1, 1], 
        [1, 64, 28, 28], 
        [96, 192, 1, 1], 
        [1, 96, 1, 1], 
        [1, 96, 28, 28], 
        [1, 128, 28, 28], 
        [16, 192, 1, 1], 
        [1, 16, 1, 1], 
        [1, 16, 28, 28], 
        [32, 16, 5, 5], 
        [1, 32, 1, 1], 
        [1, 32, 28, 28], 
        [1, 192, 28, 28], 
        [1, 32, 28, 28], 
        [1, 256, 28, 28], 
        [1, 128, 28, 28], 
        [1, 192, 28, 28], 
        [1, 32, 28, 28], 
        [96, 32, 5, 5], 
        [1, 96, 1, 1], 
        [1, 96, 28, 28], 
        [1, 64, 28, 28], 
        [1, 480, 28, 28], 
        [1, 480, 14, 14], 
        [1, 192, 14, 14], 
        [1, 208, 14, 14], 
        [1, 16, 14, 14], 
        [48, 16, 5, 5], 
        [1, 48, 1, 1], 
        [1, 48, 14, 14], 
        [1, 64, 14, 14], 
        [1, 512, 14, 14], 
        [1, 160, 14, 14], 
        [1, 224, 14, 14], 
        [1, 24, 14, 14], 
        [64, 24, 5, 5], 
        [1, 64, 1, 1], 
        [1, 64, 14, 14], 
        [1, 64, 14, 14], 
        [1, 512, 14, 14], 
        [1, 128, 14, 14], 
        [1, 256, 14, 14], 
        [1, 24, 14, 14], 
        [64, 24, 5, 5], 
        [1, 64, 1, 1], 
        [1, 64, 14, 14], 
        [1, 64, 14, 14], 
        [1, 512, 14, 14], 
        [1, 112, 14, 14], 
        [1, 288, 14, 14], 
        [1, 32, 14, 14], 
        [64, 32, 5, 5], 
        [1, 64, 1, 1], 
        [1, 64, 14, 14], 
        [1, 64, 14, 14], 
        [1, 528, 14, 14], 
        [1, 256, 14, 14], 
        [1, 320, 14, 14], 
        [1, 32, 14, 14], 
        [128, 32, 5, 5], 
        [1, 128, 1, 1], 
        [1, 128, 14, 14], 
        [1, 128, 14, 14], 
        [1, 832, 14, 14], 
        [1, 832, 7, 7], 
        [1, 256, 7, 7], 
        [1, 320, 7, 7], 
        [1, 32, 7, 7], 
        [128, 32, 5, 5], 
        [1, 128, 1, 1], 
        [1, 128, 7, 7], 
        [1, 128, 7, 7], 
        [1, 832, 7, 7], 
        [1, 384, 7, 7], 
        [1, 384, 7, 7], 
        [1, 48, 7, 7], 
        [128, 48, 5, 5], 
        [1, 128, 1, 1], 
        [1, 128, 7, 7], 
        [1, 128, 7, 7], 
        [1, 1024, 7, 7], 
        [1, 1000], 
        [1, 1], 
        [1, 1000], 
        [1, 1], 
        [1, 1000]
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96
  ]
}